bit-finance/Reports/бит_УдалитьУниверсальныйОтчетИсточникиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_УдалитьУниверсальныйОтчетИсточникиДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПулаПодключений</Name>
					<Comment>Настройка пула подключений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиПуловПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/Enums/бит_ТипыСохраненныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСохраненныхНастроек</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиПанелиИндикаторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ВидыПараметровЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыПараметровЗапроса</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Список</Name>
					<Comment>Список</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
					<Comment>Выражение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Reports/бит_УдалитьУниверсальныйОтчетИсточникиДанных/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем мТекущийВидПараметра; // Служит для передачи вида параметра между обработчиками.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Отчет);
	
	фПолноеИмяОтчета = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ЭтотОбъект.ИмяФормы, Истина);
			
	// Вызов механизма защиты
	
	Если фОтказ Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьКэшЗначений();
	ЗаполнитьДополнительныеСписки();
	
	Если Параметры.Свойство("НастройкаОтчета") Тогда
		Отчет.НастройкаОтчета = Параметры.НастройкаОтчета;
	Иначе
		ОбновитьПанельСохраненныхНастроек();
	КонецЕсли;	  	
	
	бит_ОтчетыСервер.УстановитьВидимостьПанелиНастроекПоУмолчаниюТакси(Элементы.ФормаКомандаПанельНастроек
														, Элементы.ГруппаПанельНастроек
														, фСкрытьПанельНастроек
														, фТаксиОткрытьПанельНастроек);
														
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Отчет.НастройкаОтчета) Тогда
		ИзменениеНастройки();
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	// Установка флага в Ложь для беспрепятственного закрытия формы.
	ВариантМодифицирован = Ложь;
	
КонецПроцедуры // ПередЗакрытием()

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Видимость панели настроек.
	бит_ОтчетыСервер.УстановитьВидимостьПанелиНастроек(Элементы.ФормаКомандаПанельНастроек, 
		Элементы.ГруппаПанельНастроек, фСкрытьПанельНастроек, фТаксиОткрытьПанельНастроек);
	
	// Видимость структуры отчета
	Если фОтображатьСтруктуру Тогда
	    ТекстСообщения = НСтр("ru = 'Скрыть структуру'; en = 'To hide the structure'"); 
	Иначе	
	    ТекстСообщения = НСтр("ru = 'Показать структуру'; en = 'To show the structure'");
	КонецЕсли;	
	Элементы.КомандаПоказатьСкрытьСтруктуру.Заголовок = ТекстСообщения;
	Элементы.ГруппаКомпоновщикСтруктура.Видимость     = фОтображатьСтруктуру;
	             	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаОтчетаПриИзменении(Элемент)
	
	ИзменениеНастройки();
		
КонецПроцедуры // НастройкаОтчетаПриИзменении()

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	БухгалтерскиеОтчетыКлиент.НачатьРасчетСуммыВыделенныхЯчеек(
		Элементы.Результат,
		ЭтотОбъект,
		"Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры // РезультатПриАктивизацииОбласти()

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиПриИзменении(Элемент)
	
	ИзменитьМодифицированностьВарианта(Истина);
	
КонецПроцедуры // КомпоновщикНастроекНастройкиПриИзменении()

									
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	ОбработкаРасшифровкиОтчета(Расшифровка, СтандартнаяОбработка);
	
КонецПроцедуры // РезультатОбработкаРасшифровки()
									
&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	ОбработкаРасшифровкиОтчета(Расшифровка, СтандартнаяОбработка, Истина);	
	
КонецПроцедуры // РезультатОбработкаДополнительнойРасшифровки()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПараметры

&НаКлиенте
Процедура ТаблицаПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;	 	
	
	Если НоваяСтрока И НЕ Копирование Тогда  		
		ТекущиеДанные.ВидПараметра = фКэшЗначений.Перечисления.бит_ВидыПараметровЗапроса.Значение;   			
	КонецЕсли; 
	
	мТекущийВидПараметра = ТекущиеДанные.ВидПараметра;
	
	ОграничитьОписаниеТиповПараметра();
		
КонецПроцедуры // ТаблицаПараметрыПриНачалеРедактирования()

&НаКлиенте
Процедура ТаблицаПараметрыВидПараметраПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ИД = Элементы.ТаблицаПараметры.ТекущиеДанные.ПолучитьИдентификатор();
		ИзменитьВидПараметра(ИД, мТекущийВидПараметра);
		
		мТекущийВидПараметра = ТекущиеДанные.ВидПараметра;
		
		ОграничитьОписаниеТиповПараметра();
				
	КонецЕсли; 
			
КонецПроцедуры // ТаблицаПараметрыВидПараметраПриИзменении()

&НаКлиенте
Процедура ТаблицаПараметрыЗначениеПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные        = Элементы.ТаблицаПараметры.ТекущиеДанные;	
	мТекущийВидПараметра = ТекущиеДанные.ВидПараметра;
	
	Если мТекущийВидПараметра = фКэшЗначений.Перечисления.бит_ВидыПараметровЗапроса.Выражение Тогда  		
		СтандартнаяОбработка = Ложь;			
	КонецЕсли;

КонецПроцедуры // ТаблицаПараметрыЗначениеПараметраНачалоВыбора()

&НаКлиенте
Процедура ТаблицаПараметрыЗначениеПараметраОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;
	
	Если ТекущиеДанные.ВидПараметра = фКэшЗначений.Перечисления.бит_ВидыПараметровЗапроса.Значение Тогда		
		Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Истина;
	КонецЕсли;
    	
КонецПроцедуры // ТаблицаПараметрыЗначениеПараметраОчистка()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборВОтчете

&НаКлиенте
Процедура ОтборВОтчетеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;	
	
	Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = ТекущиеДанные.Значение = Неопределено;
	
	Если НЕ НоваяСтрока Тогда
		бит_МеханизмПолученияДанныхКлиентСервер.УстановитьСвойствоВыборГруппИЭлементов(Элементы.ОтборВОтчетеЗначение, 
			ТекущиеДанные.ВидСравнения);
	КонецЕсли; 
	
КонецПроцедуры // ОтборВОтчетеПриНачалеРедактирования()

&НаКлиенте
Процедура ОтборВОтчетеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Модифицированность = Истина;
	
КонецПроцедуры // ОтборВОтчетеПриОкончанииРедактирования()

&НаКлиенте
Процедура ОтборВОтчетеВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(фКэшЗначений.МассивВидовСравнения); 
	
КонецПроцедуры
     
&НаКлиенте
Процедура ОтборВОтчетеВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ИзменениеВидаСравненияТаблицыОтборов(ТекущиеДанные.ПолучитьИдентификатор());	

КонецПроцедуры

&НаКлиенте
Процедура ОтборВОтчетеЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборВОтчете.ТекущиеДанные;
	ИзменениеЗначенияТаблицыОтборов(ТекущиеДанные.ПолучитьИдентификатор());
		
КонецПроцедуры // ОтборВОтчетеЗначениеПриИзменении()

&НаКлиенте
Процедура ОтборВОтчетеЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ОтборВОтчетеЗначение.ВыбиратьТип = Истина;
	
КонецПроцедуры // ОтборВОтчетеЗначениеОчистка()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
		
	Если ЗначениеЗаполнено(Отчет.НастройкаОтчета) Тогда
		СформироватьОтчетСервер();
	Иначе
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, 
			НСтр("ru = 'Настройка отчета'; en = 'Report Setup'"));
			
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "НастройкаОтчета", "Отчет");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастроитьПериод(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОткрытьДиалогСтандартногоПериода(Отчет);
	
КонецПроцедуры // КомандаНастроитьПериод()

&НаКлиенте
Процедура КомандаПанельНастроек(Команда)
	
	ОбработкаКомандыПанелиНастроекСервер();
	
КонецПроцедуры // КомандаПанельНастроек()

&НаКлиенте
Процедура Результат_ПоказатьВОтдельномОкне(Команда)
	
	бит_ОтчетыКлиент.ПоказатьКопиюРезультата(Результат);	
		
КонецПроцедуры // Результат_ПоказатьВОтдельномОкне()

&НаКлиенте
Процедура КомандаПоказатьСкрытьСтруктуру(Команда)
	
	фОтображатьСтруктуру = Не фОтображатьСтруктуру;
	
	Если фОтображатьСтруктуру Тогда
	 	ТекстСообщения = НСтр("ru='Скрыть структуру варианта';en='Hide the option structure'"); 
	Иначе
		ТекстСообщения = НСтр("ru='Показать структуру варианта';en='To show the structure of the option'"); 
	КонецЕсли; 
	
	// Видимость структуры отчета.
	Элементы.КомандаПоказатьСкрытьСтруктуру.Заголовок = ТекстСообщения;
	Элементы.ГруппаКомпоновщикСтруктура.Видимость = фОтображатьСтруктуру;
	
	Если фОтображатьСтруктуру Тогда
		Элементы.ГруппаСтраницыНастроек.ТекущаяСтраница = Элементы.СтраницаКомпоновщик;
		ЭтотОбъект.ТекущийЭлемент = Элементы.КомпоновщикНастроекНастройки;
	КонецЕсли;
	
КонецПроцедуры // КомандаПоказатьСкрытьСтруктуру()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СерверныеПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет кэш значений.
// 
// Параметры:
//  Нет
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	фКэшЗначений = Новый Структура;
	
	фКэшЗначений.Вставить("ИмяТипаОтчета", СтрЗаменить(фПолноеИмяОтчета, "Отчет.", "ОтчетОбъект."));

	фКэшЗначений.Вставить("МассивВидовСравнения",бит_МеханизмПолученияДанных.СформироватьСписокВыбораДляОтборовВОтчете("Массив"));

	фКэшЗначений.Вставить("ТипНастройки"	   , Перечисления.бит_ТипыСохраненныхНастроек.Отчеты);
	фКэшЗначений.Вставить("НастраиваемыйОбъект", "Отчет.бит_УниверсальныйОтчетИсточникиДанных_Скд");
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("Строка"));
	КвСтроки = Новый КвалификаторыСтроки(500);
	ОписаниеТипаСтрока = Новый ОписаниеТипов(МассивТипов, , КвСтроки);
	фКэшЗначений.Вставить("ОписаниеТипаСтрока", ОписаниеТипаСтрока);
	фКэшЗначений.Вставить("ОписаниеПроизвольногоТипа", бит_ОбщегоНазначения.ОписаниеПроизвольногоТипа());
	
	
	// Перечисления
	КэшПеречисления = Новый Структура;
	
	ТекПеречисление = бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ВидыПараметровЗапроса);
	КэшПеречисления.Вставить("бит_ВидыПараметровЗапроса",ТекПеречисление);
	
	фКэшЗначений.Вставить("Перечисления",КэшПеречисления);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

// Процедура заполняет дополнительные списки.
// 
// Параметры:
//  Нет
// 
&НаСервере
Процедура ЗаполнитьДополнительныеСписки()

	// Список имен параметров СКД, заполняемых пользователем через элементы формы.
	ИмяОтчета = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ЭтотОбъект.ИмяФормы, Ложь); 
	Отчеты[ИмяОтчета].ЗаполнитьДополнительныеСписки(фСписокПараметровНаФорме);
		
КонецПроцедуры // ЗаполнитьДополнительныеСписки()

// Процедура ограничивает описание типов в строке таблица параметров.
// 
// Параметры:
//  Нет
// 
&НаКлиенте
Процедура ОграничитьОписаниеТиповПараметра()

	ТекущиеДанные = Элементы.ТаблицаПараметры.ТекущиеДанные;
	
	Если мТекущийВидПараметра = фКэшЗначений.Перечисления.бит_ВидыПараметровЗапроса.Выражение Тогда
			
		ОписаниеОграничение = фКэшЗначений.ОписаниеТипаСтрока;
		
	Иначе
		
		Если ТекущиеДанные.ЗначениеПараметра = Неопределено Тогда  		
			Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Истина; 		
		Иначе	                                                        		
			Элементы.ТаблицаПараметрыЗначениеПараметра.ВыбиратьТип = Ложь;  		
		КонецЕсли; 
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СписокЗначений"));
		Если ЗначениеЗаполнено(ТекущиеДанные.ДоступныеТипы) Тогда
			ОписаниеОграничение = Новый ОписаниеТипов(ТекущиеДанные.ДоступныеТипы, МассивТипов);
		Иначе		
			ОписаниеОграничение = Новый ОписаниеТипов(фКэшЗначений.ОписаниеПроизвольногоТипа, МассивТипов);
		КонецЕсли;
		
	КонецЕсли;	
	
	// Ограничим тип значения
	Элементы.ТаблицаПараметрыЗначениеПараметра.ОграничениеТипа = ОписаниеОграничение;  

КонецПроцедуры // ОграничитьОписаниеТиповПараметра()

// Процедура выполняет обработку расшифровки отчета.
// 
// Параметры:
//  Расшифровка 		 - ИндентификаторРасшифровкиКомпоновкиДанных.
//  СтандартнаяОбработка - Булево.
//  ОткрыватьДопЗначение - Булево (По умолчанию = Ложь).
// 
&НаКлиенте
Процедура ОбработкаРасшифровкиОтчета(Расшифровка, СтандартнаяОбработка, ОткрыватьДопЗначение = Ложь)
	
	ПараметрыРасшифровки = бит_ОтчетыКлиент.НовыеПараметрыРасшифровки();
	ПараметрыРасшифровки.ФормаВладелец            = ЭтотОбъект;
	ПараметрыРасшифровки.Расшифровка              = Расшифровка;
	ПараметрыРасшифровки.ДанныеРасшифровки        = ДанныеРасшифровки;
	ПараметрыРасшифровки.ИмяОтчета                = фПолноеИмяОтчета;
	ПараметрыРасшифровки.АдресСКД                 = ПолучитьАдресСКД();
	ПараметрыРасшифровки.ЗаполнятьВыбранные       = Истина;
	ПараметрыРасшифровки.ОткрыватьДопЗначение     = ОткрыватьДопЗначение;
	
	бит_ОтчетыКлиент.ОбработкаРасшифровки(ПараметрыРасшифровки, СтандартнаяОбработка);
		
КонецПроцедуры

// Процедура - обработчик команды "КомандаПанельНастроек".
// 
// Параметры: 
//  СкрытьПанельПриФормировании - Булево (По умолчанию = Ложь).
//
&НаСервере
Процедура ОбработкаКомандыПанелиНастроекСервер(СкрытьПанельПриФормировании = Ложь)
	
	// Видимость панели настроек
	бит_ОтчетыСервер.ОбработкаКомандыПанелиНастроек(Элементы.ФормаКомандаПанельНастроек
													 , Элементы.ГруппаПанельНастроек
													 , фСкрытьПанельНастроек
													 , фТаксиОткрытьПанельНастроек
													 , СкрытьПанельПриФормировании);
	
КонецПроцедуры // ОбработкаКомандыПанелиНастроекСервер()

// Процедура заполняет таблицу отборов.
// 
// Параметры:
//  Нет
// 
&НаСервере
Процедура ЗаполнитьТаблицуОтборов()

	ТаблицаОтборов = РеквизитФормыВЗначение("ОтборВОтчете");
	бит_МеханизмПолученияДанных.ЗаполнитьОтборВОтчете(Отчет.НастройкаОтчета.ИсточникДанных, ТаблицаОтборов);
	ЗначениеВДанныеФормы(ТаблицаОтборов, ОтборВОтчете);	

КонецПроцедуры // ЗаполнитьТаблицуОтборов()

// Процедура меняет модифицированность варианта.
// 
// Параметры:
//  Модифицирован  - Булево.
// 
&НаСервере
Процедура ИзменитьМодифицированностьВарианта(Модифицирован)

	ВариантМодифицирован = Модифицирован;
	
	Элементы.ГруппаКомпоновщикСтруктура.Заголовок = ?(ВариантМодифицирован, 
			НСтр("ru='Струкутра отчета (не соответствует варианту по умолчанию)'; 
				 |en='Report structure (does not match the default option)'"), 
			НСтр("ru='Структура отчета';en='Report structure'"));

КонецПроцедуры // ИзменитьМодифицированностьВарианта()

// Процедура выполняет действия, неоходимые при настройки отчета.
// 
// Параметры:
//  Нет
// 
&НаСервере
Процедура ИзменениеНастройки()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, 
		"НЕАКТУАЛЬНОСТЬ");	

	Если НЕ ЗначениеЗаполнено(Отчет.НастройкаОтчета) Тогда 
		Возврат;                                    	
	КонецЕсли;
	
	бит_МеханизмПолученияДанных.ОбновитьТаблицуПараметров(Отчет.НастройкаОтчета.ИсточникДанных, ТаблицаПараметры, Истина);	
	ЗаполнитьТаблицуОтборов();
	 	
	Отчет.Язык = Отчет.НастройкаОтчета.Язык;
	
	ИнициализироватьСКД(Неопределено);
	
	ИзменитьМодифицированностьВарианта(Ложь);
	
КонецПроцедуры // ИзменениеНастройки()
 
// Процедура выполняет действия, неоходимые при изменении вида параметра в таблице параметров.
// 
// Параметры:
//  ИД  				- Число.
//  ТекущийВидПараметра - ПеречислениеСсылка.бит_ВидыПараметровЗапроса.
// 
&НаСервере
Процедура ИзменитьВидПараметра(ИД, ТекущийВидПараметра)

	ТекущиеДанные = ТаблицаПараметры.НайтиПоИдентификатору(ИД);
	бит_МеханизмПолученияДанных.ИзменениеВидаПараметра(ТекущиеДанные, ТекущийВидПараметра);

КонецПроцедуры // ИзменитьВидПараметра()

// Процедура выполняет действия, неоходимые при изменении вида сравнения в таблице отборов.
// 
// Параметры:
//  ИД - Число.
// 
&НаСервере
Процедура ИзменениеВидаСравненияТаблицыОтборов(Ид)
		
	ТекущиеДанные = ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ИзменениеВидаСравнения(ТекущиеДанные);	
	
	бит_МеханизмПолученияДанныхКлиентСервер.УстановитьСвойствоВыборГруппИЭлементов(Элементы.ОтборВОтчетеЗначение, 
			ТекущиеДанные.ВидСравнения);

КонецПроцедуры

// Процедура выполняет действия, неоходимые при изменении значения в таблице отборов.
// 
// Параметры:
//  ИД  				- Число
// 
&НаСервере
Процедура ИзменениеЗначенияТаблицыОтборов(Ид)
	
	ТекущиеДанные = ОтборВОтчете.НайтиПоИдентификатору(Ид);
	бит_МеханизмПолученияДанных.ОтборВОтчетеЗначениеПриИзменении(ТекущиеДанные);
		
КонецПроцедуры // ИзменениеЗначенияТаблицыОтборов()

#КонецОбласти

#Область ФормированиеОтчета

// Функция получает адрес СКД отчета.
// 
// Параметры:
//  Нет.
//  
// Возвращаемое значение:
//   Строка.
// 
&НаСервере
Функция ПолучитьАдресСКД()

	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	СКД = ОтчетОбъект.СхемаКомпоновкиДанных;
	АдресХранилищаСКД = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор); 

	Возврат АдресХранилищаСКД;
	
КонецФункции // ПолучитьАдресСКД()

// Процедура инициализирует СКД.
// 
// Параметры:
//  ТаблицаРезультат  				- ТаблицаЗначений.
//  ОбновлятьНастройкиПоУмолчанию 	- Булево.
//  НастройкиКд 					- НастройкиКомпоновкиДанных (По умолчанию = Неопределено).
//  ПользовательскиеНастройкиКд     - ПользовательскиеНастройкиКомпоновщикаДанных (По умолчанию = Неопределено).
//
&НаСервере
Процедура ИнициализироватьСКД(ТаблицаРезультат, ОбновлятьНастройкиПоУмолчанию = Истина, 
	НастройкиКд = Неопределено, ПользовательскиеНастройкиКд = Неопределено)

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ОтборВОтчете"    , РеквизитФормыВЗначение("ОтборВОтчете"));
	СтруктураТаблиц.Вставить("ТаблицаПараметры", РеквизитФормыВЗначение("ТаблицаПараметры"));
	
	АдресХранилищаСКД = ОтчетОбъект.ИнициализироватьСКД(СтруктураТаблиц, ТаблицаРезультат, ОбновлятьНастройкиПоУмолчанию, 
							НастройкиКд, ПользовательскиеНастройкиКд);
	
	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
	
КонецПроцедуры

// Процедура формирует отчет.
// 
// Параметры:
//  Нет
// 
&НаСервере
Процедура СформироватьОтчетСервер()

	// Очистка табличного поля
	Результат.Очистить();
		
	ТаблицаРезультат = Неопределено;
	ИнициализироватьСКД(ТаблицаРезультат, Ложь);
	
	// --------------------------------------------------------------------------------
	// Вывод отчета
	
	СКД = ПолучитьИзВременногоХранилища(АдресХранилищаСКД);	
	
	// Временное сохранение расшифровки данных
	ДанныеРасшифровки1 = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	// Формирование макета, с помощью компоновщика макета.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	            	
	// Настройки по умолчанию
	Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
						
	// Передача схемы, настроек и данных расшифровки в макет компоновки.
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки1);
	
	ОбъектОтчета	 = РеквизитФормыВЗначение("Отчет");
	ТаблицаРезультат = ОбъектОтчета.ДанныеПоИсточнику(РеквизитФормыВЗначение("ТаблицаПараметры"), РеквизитФормыВЗначение("ОтборВОтчете"));
	
	// Внешние наборы данных	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("мТаблицаРезультат", ТаблицаРезультат);
	
	// Выполнение компоновки с помощью процессора компоновки.
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки1, Истина);
                  
	// Вывод таблицы   	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.УстановитьДокумент(Результат); 	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// --------------------------------------------------------------------------------
	// Сохранение данных расшифровки в хранилище
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки1, УникальныйИдентификатор);

	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, 
		"НЕИСПОЛЬЗОВАТЬ");
	
КонецПроцедуры
	
#КонецОбласти 
	
#Область Настройки

// Процедура обновляет панель сохраненных настроек.
// 
// Параметры:
//  Очищать  - Булево (Необязательный, по умолчанию = Ложь).
//  ТекКлючНастройки  (Необязательный).
// 
&НаСервере
Процедура ОбновитьПанельСохраненныхНастроек()

	ГруппаПанели = Элементы.ГруппаПанельВыбораСохраненныхНастроек;
	КлючОбъекта = фПолноеИмяОтчета + "_СКД";
	
	СтруктураДоступности = бит_ОтчетыСервер.ПроверитьДоступностьВариантовНастроек(КлючОбъекта, Ложь);
	СтруктураСохраненныхНастроек = Неопределено;
	ИмяЭлементаВыбраннаяНастройка = "";
	бит_ОтчетыСервер.ОбновитьПанельСохраненныхНастроек(Элементы, 
													ГруппаПанели, 
													КлючОбъекта, 
													СтруктураСохраненныхНастроек,
													СтруктураДоступности,
													Ложь,
													ИмяЭлементаВыбраннаяНастройка);
	
	// Установка настройки, используемой при открытии, если такая указана в справочнике.
	ТекКлючНастройки = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(КлючОбъекта, Истина);
	
	Если ТекКлючНастройки <> Неопределено Тогда
		Результат.Очистить();
		УстановитьТекущиеПользовательскиеНастройки(ТекКлючНастройки);
		бит_ОтчетыСервер.ВыделитьТекущуюСохраненнуюНастройку(Элементы, 
														СтруктураСохраненныхНастроек, 
														ИмяЭлементаВыбраннаяНастройка,
														Ложь,
														ТекКлючНастройки);
		ТекНастройки = бит_ОтчетыСервер.ПолучитьНастройкиОтчета(СтруктураСохраненныхНастроек[ИмяЭлементаВыбраннаяНастройка]);
		ПрименитьНастройки(ТекНастройки);
	КонецЕсли;
		
КонецПроцедуры // ОбновитьПанельСохраненныхНастроек()

&НаСервере
Функция НовыеСохраненныеНастройки()

	Возврат Отчеты.бит_УдалитьУниверсальныйОтчетИсточникиДанных.НовыеСохраненныеНастройки();
	
КонецФункции

&НаСервере
Функция УпаковатьНастройкиВСтруктуру()

	СохраненныеНастройки = НовыеСохраненныеНастройки();
	ЗаполнитьЗначенияСвойств(СохраненныеНастройки, Отчет);
	
	Значение = РеквизитФормыВЗначение("ОтборВОтчете");
	СохраненныеНастройки.ОтборВОтчете = бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(Значение);
	
	Значение = РеквизитФормыВЗначение("ТаблицаПараметры");
	СохраненныеНастройки.ТаблицаПараметры = бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(Значение);
	
	Если ВариантМодифицирован Тогда
		СохраненныеНастройки.НастройкиКомпоновщика = Отчет.КомпоновщикНастроек.Настройки; 
	КонецЕсли;
	
	СохраненныеНастройки.ПользовательскиеНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	Возврат СохраненныеНастройки;
	
КонецФункции

// Процедура применяет сохраненну настройки.
// 
// Параметры:
//  ВыбНастройка  - СправочникСсылка.бит_СохраненныеНастройки.
// 
&НаСервере
Процедура ПрименитьНастройки(ВыбНастройка)
		
	Если Не ЗначениеЗаполнено(ВыбНастройка) Тогда	
		Возврат;     		
	КонецЕсли;
	
	Если ТипЗнч(ВыбНастройка) = Тип("Структура") Тогда
		СтруктураНастроек = ВыбНастройка;
	Иначе
		СтруктураНастроек = ВыбНастройка.ХранилищеНастроек.Получить();
	КонецЕсли;
	
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		
		// Заполним ожидаюмую архитетктуру настроек.
		СохраненныеНастройки = НовыеСохраненныеНастройки();
		ЗаполнитьЗначенияСвойств(СохраненныеНастройки, СтруктураНастроек);
		
		// Восстановим настройки.
		ЗаполнитьЗначенияСвойств(Отчет, СохраненныеНастройки);
		
		Значение = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(СохраненныеНастройки.ОтборВОтчете);
		Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда
			ЗначениеВРеквизитФормы(Значение, "ОтборВОтчете");
		КонецЕсли;
				
		Значение = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(СохраненныеНастройки.ТаблицаПараметры);
		Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда
			ЗначениеВРеквизитФормы(Значение, "ТаблицаПараметры");
		КонецЕсли;

		НастройкиКомпоновщика 	  = СохраненныеНастройки.НастройкиКомпоновщика;
		ПользовательскиеНастройки = СохраненныеНастройки.ПользовательскиеНастройки;
		
		ИнициализироватьСКД(Неопределено, , НастройкиКомпоновщика, ПользовательскиеНастройки);
		
		Если ЗначениеЗаполнено(СохраненныеНастройки.НастройкиКомпоновщика.Выбор.Элементы) Тогда
			ИзменитьМодифицированностьВарианта(Истина);
		КонецЕсли;		
	
	Иначе
		ТекстСообщения = НСтр("ru='Настройки не восстановлены.';en='Settings not restored'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
	КонецЕсли;  		
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСохранить(Кнопка)
	
	ПараметрыФормы     = Новый Структура;
	СтруктураНастройки = УпаковатьНастройкиВСтруктуру();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СтруктураНастройки);
	ПараметрыФормы.Вставить("ТипНастройки"		 , фКэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", фКэшЗначений.НастраиваемыйОбъект);
	
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, ЭтотОбъект);	
													
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВосстановить(Кнопка)
	
	ПараметрыФормы     = Новый Структура;
	ПараметрыФормы.Вставить("ТипНастройки"		 , фКэшЗначений.ТипНастройки);
	ПараметрыФормы.Вставить("НастраиваемыйОбъект", фКэшЗначений.НастраиваемыйОбъект);
	
	Обработчик = Новый ОписаниеОповещения("НастройкиВосстановитьЗавершение", ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки"
					, ПараметрыФормы, ЭтотОбъект, , , , Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

// Процедура обработчик оповещения "НастройкиВосстановитьЗавершение".
// 
// Параметры:
// Настройка - Структура.
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура НастройкиВосстановитьЗавершение(Настройка, ДополнительныеДанные) Экспорт
	
	Если ЗначениеЗаполнено(Настройка) Тогда		
		ПрименитьНастройки(Настройка);		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, 
		"НЕАКТУАЛЬНОСТЬ");
	
КонецПроцедуры // НастройкиВосстановитьЗавершение()

// Процедура - обработчик события "Нажатие" кнопки "НастройкиУстановитьСтандартныеНастройки".
// 
&НаКлиенте
Процедура НастройкиУстановитьСтандартныеНастройки(Команда)
	
	ИзменениеНастройки();
	
КонецПроцедуры
	
#КонецОбласти  
	
#Область ПодсчетСуммыВТабличномДокументеПриАктивизации

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	СуммаОтчета = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		СуммаОтчета, Результат, Элементы.Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
